# Dice roll

import random
dicimg = {1:("┌───────────┐","│           │","│           │","│     ●     │","│           │","│           │","└───────────┘"),
          2:("┌───────────┐","│ ●         │","│           │","│           │","│           │","│         ● │","└───────────┘"),
          3:("┌───────────┐","│ ●         │","│           │","│     ●     │","│           │","│         ● │","└───────────┘"),
          4:("┌───────────┐","│ ●       ● │","│           │","│           │","│           │","│ ●       ● │","└───────────┘"),
          5:("┌───────────┐","│ ●       ● │","│           │","│     ●     │","│           │","│ ●       ● │","└───────────┘"),
          6:("┌───────────┐","│ ●   ●   ● │","│           │","│ ●   ●   ● │","│           │","│ ●   ●   ● │","└───────────┘")}

dice = []
k = int(input("Enter no of dice: "))
for i in range(k):
    dice.append(random.randint(1,6))

#for die in dice:
#    for part in dicimg[die]:
#        print(part)

for p in range(len(dicimg[random.randint(1,6)])):
    for die in dice:
        print(dicimg[die][p], end = "")
    print()
print("Total dice count is:",sum(dice))

